In [1]:
#data dividation=>it means splitting your dataset into parts(x & y) for training and testing a ML model
#->training model=>used to teach the data=approx 70-80% data
#testing model=>used to check if model works well or not=20-30% data
'''
Class----> x(input) + y(targetdata)
x(input) ----> x_train + x_test
y(target) ---->y_train + y_test

machine(x_train,y_train) ---> machine(x_test)---->output ????Prediction(y_pred)
actual_Data(y_test)

df=2+2 =4
3+2=5
5+3=8

x(2+2, 3+2 ,5+3)
y(4,5,8)

x_train(2+2,3+2)
y_train(4,5)
machine(x_train,y_train)
machine ---> predict(9)
but actual_output=8 ....in this we check performance of machine
'''90

'\nClass----> x(input) + y(targetdata)\nx(input) ----> x_train + x_test\ny(target) ---->y_train + y_test\n\nmachine(x_train,y_train) ---> machine(x_test)---->output ????Prediction(y_pred)\nactual_Data(y_test)\n\ndf=2+2 =4\n3+2=5\n5+3=8\n\nx(2+2, 3+2 ,5+3)\ny(4,5,8)\n\nx_train(2+2,3+2)\ny_train(4,5)\nmachine(x_train,y_train)\nmachine ---> predict(9)\nbut actual_output=8 ....in this we check performance of machine\n'

In [2]:
import numpy as np
import pandas as pd

In [3]:
df=pd.read_csv("placement.csv")

In [4]:
df

    cgpa  resume_score  placed
0   8.14          6.52       1
1   6.17          5.17       0
2   8.27          8.86       1
3   6.88          7.27       1
4   7.52          7.30       1
..   ...           ...     ...
95  6.33          6.38       0
96  8.23          7.76       1
97  6.65          7.78       0
98  8.14          5.63       1
99  6.09          6.61       0

[100 rows x 3 columns]

In [5]:
df.head()

   cgpa  resume_score  placed
0  8.14          6.52       1
1  6.17          5.17       0
2  8.27          8.86       1
3  6.88          7.27       1
4  7.52          7.30       1

In [6]:
df.shape

(100, 3)

In [7]:
df.isnull().sum()

cgpa            0
resume_score    0
placed          0
dtype: int64

In [8]:
df=df.dropna()
df.isnull().sum()

cgpa            0
resume_score    0
placed          0
dtype: int64

In [9]:
x=df.drop(columns=['placed'])#input columns
x

    cgpa  resume_score
0   8.14          6.52
1   6.17          5.17
2   8.27          8.86
3   6.88          7.27
4   7.52          7.30
..   ...           ...
95  6.33          6.38
96  8.23          7.76
97  6.65          7.78
98  8.14          5.63
99  6.09          6.61

[100 rows x 2 columns]

In [10]:
y=df['placed']
y

0     1
1     0
2     1
3     1
4     1
     ..
95    0
96    1
97    0
98    1
99    0
Name: placed, Length: 100, dtype: int64

In [11]:
from sklearn.model_selection import train_test_split

In [12]:
x_train,x_test,y_train,y_test=train_test_split(x,
                                               y,
                                               test_size=0.2,
                                               random_state=42)

In [13]:
print("total dataframe shape:",df.shape)
print("Input data shape:",x.shape)
print("x_train data shape:",x_train.shape)
print("x_test data shape:",x_test.shape)
print("--------------------------------")
print("y data shape",y.shape)
print("y_train data shape:",y_train.shape)
print("y_test data shape:",y_test.shape)

total dataframe shape: (100, 3)
Input data shape: (100, 2)
x_train data shape: (80, 2)
x_test data shape: (20, 2)
--------------------------------
y data shape (100,)
y_train data shape: (80,)
y_test data shape: (20,)

In [14]:
#df(100,3)=x(100,2)+y(100,1)
#x(100,2)=x_train(80,2)+x_test(20,2)
#(100,1)=y_train(80,1)+y_test(20,1)

In [15]:
df=pd.read_csv("covid_toy.csv")

In [16]:
df

    age  gender  fever   cough       city has_covid
0    60    Male  103.0    Mild    Kolkata        No
1    27    Male  100.0    Mild      Delhi       Yes
2    42    Male  101.0    Mild      Delhi        No
3    31  Female   98.0    Mild    Kolkata        No
4    65  Female  101.0    Mild     Mumbai        No
..  ...     ...    ...     ...        ...       ...
95   12  Female  104.0    Mild  Bangalore        No
96   51  Female  101.0  Strong    Kolkata       Yes
97   20  Female  101.0    Mild  Bangalore        No
98    5  Female   98.0  Strong     Mumbai        No
99   10  Female   98.0  Strong    Kolkata       Yes

[100 rows x 6 columns]

In [17]:
df.head(3)

   age gender  fever cough     city has_covid
0   60   Male  103.0  Mild  Kolkata        No
1   27   Male  100.0  Mild    Delhi       Yes
2   42   Male  101.0  Mild    Delhi        No

In [18]:
df.shape

(100, 6)

In [19]:
df.isnull().sum()

age           0
gender        0
fever        10
cough         0
city          0
has_covid     0
dtype: int64

In [20]:
df=df.dropna()

In [21]:
df.isnull().sum()

age          0
gender       0
fever        0
cough        0
city         0
has_covid    0
dtype: int64

In [22]:
df.shape

(90, 6)

In [23]:
from sklearn.model_selection import train_test_split

In [24]:
x=df.drop(columns=['has_covid']) #input columns
x

    age  gender  fever   cough       city
0    60    Male  103.0    Mild    Kolkata
1    27    Male  100.0    Mild      Delhi
2    42    Male  101.0    Mild      Delhi
3    31  Female   98.0    Mild    Kolkata
4    65  Female  101.0    Mild     Mumbai
..  ...     ...    ...     ...        ...
95   12  Female  104.0    Mild  Bangalore
96   51  Female  101.0  Strong    Kolkata
97   20  Female  101.0    Mild  Bangalore
98    5  Female   98.0  Strong     Mumbai
99   10  Female   98.0  Strong    Kolkata

[90 rows x 5 columns]

In [25]:
y=df['has_covid']
y.shape

(90,)

In [26]:
x.shape

(90, 5)

In [27]:
from sklearn.model_selection import train_test_split

In [28]:
x_train,x_test,y_train,y_test=train_test_split(x,
                                               y,
                                               test_size=0.2,
                                               random_state=42)

In [29]:
print("total dataframe shape:",df.shape)
print("Input data shape:",x.shape)
print("x_train data shape:",x_train.shape)
print("x_test data shape:",x_test.shape)
print("--------------------------------")
print("y data shape",y.shape)
print("y_train data shape:",y_train.shape)
print("y_test data shape:",y_test.shape)

total dataframe shape: (90, 6)
Input data shape: (90, 5)
x_train data shape: (72, 5)
x_test data shape: (18, 5)
--------------------------------
y data shape (90,)
y_train data shape: (72,)
y_test data shape: (18,)